validation/blastVdfTransportFoam/shockParticle_shockTube_1D/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (gas);

continuousPhase gas;
dilutePhase     particles;

gas
{
    type basic;
    thermoType
    {
        transport   const;
        thermo      eConst;
        equationOfState idealGas;
    }
    equationOfState
    {
        gamma           1.4;            // Heat capactiy ratio
    }
    specie
    {
        molWeight       28.97;
    }
    transport
    {
        mu              1.81e-5;
        Pr              1;
    }
    thermodynamics
    {
        type        eConst;
        Cv          718;
        Hf          0;
    }

    residualRho     1e-6;
    residualAlpha   1e-10;
}

aspectRatio
{
    type constant;
    E0   1.0;
}

drag
{
    type        SchillerNaumann;
    residualRe  1e-3;

    swarmCorrection
    {
        type none;
    }
}
