validation/blastVdfTransportFoam/shockParticle_shockTube_1D/constant/quadratureProperties.particles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      quadratureProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fieldMomentInversion basicVelocityFieldMomentInversion;


basicVelocityMomentInversion
{
    type monoKinetic;
    basicQuadrature
    {
        univariateMomentInversion   Gauss;
    }
}

extendedMomentInversion
{
    extendedMomentInversion lognormal;
    basicQuadrature
    {
        univariateMomentInversion   Gauss;
    }
}

momentAdvection
{
    velocityMomentAdvection   Vikas;
}

moments
(
    (0 0)
    (0 1)
//     (0 2)
//     (0 3)
//     (0 4)

    (1 0)
    (1 1)
//     (1 2)
//     (1 3)
//     (1 4)

    (2 0)
    (3 0)

);

nodes
(
    (0)
    (1)
//     (0 0)
//     (0 1)
//     (0 2)
//
//     (1 0)
//     (1 1)
//     (1 2)
);

// ************************************************************************* //
