validation/blastVdfTransportFoam/shockParticle_shockTube_1D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     blastVdfTransportFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         200e-6;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   20e-6;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  true;

maxCo   0.25;

functions
{
    nodes
    {
        type writeObjects;
        functionObjectLibs ( "libutilityFunctionObjects.so" );
        objects
        (
            weight.node0.particles
            weight.node1.particles
//             velocityAbscissae.node0.particles
//             velocityAbscissae.node1.particles

//             weight.node00.particles
//             weight.node01.particles
//             weight.node02.particles
//             weight.node10.particles
//             weight.node11.particles
//             weight.node12.particles
        );
        writeControl outputTime;
        writeInterval       1;
    }
}
// ************************************************************************* //
