validation/blastVdfTransportFoam/shockParticle_shockTube_1D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme       HLLC;

ddtSchemes
{
    default          Euler;
    timeIntegrator   Euler;
}

gradSchemes
{
    default         faceMDLimited leastSquares 1;
}

divSchemes
{
    default         none;
    div(tauMC)   Gauss linear;
    div((muEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default             linear;
    reconstruct(alpha)  vanLeer;
    reconstruct(U)      vanLeerV;
    reconstruct(e)      vanLeer;
    reconstruct(p)      vanLeer;
    reconstruct(rho)    vanLeer;
    reconstruct(c)      vanLeer;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
